[{"title":"从输入URL到页面加载完成到底发生了什么？","date":"2017-07-19T01:22:09.000Z","path":"2017/07/19/从输入URL到页面展示到底发生了什么/","text":"&emsp;&emsp;这应该是我开始学习前端之后看到的次数最多的一道面试题目。第一次听到的时候就胆战心惊，计算机网络和硬件方面我还是个文盲，我对软件一直更感兴趣一点，对网络和硬件就比较心虚，尤其是寒假回家大爷大妈让我修电脑的时候，我只能一再强调说自己是学软件的。为了更好地 为人民服务 学习前端，我准备从头到尾理清这道题，借此完成计算网络的攻坚克难战顺便准备技术交流的素材。&emsp;&emsp;1.输入URL后浏览器做了什么","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://wongyirong.github.io/tags/学习笔记/"}]},{"title":"爱你就像爱生命","date":"2017-07-16T11:48:49.000Z","path":"2017/07/16/爱你就像爱生命/","text":"你能建立良好的项目和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。If you can build good projects and solve problems then that’s all that matters, how you solve them (the tools) has and will always change.","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://wongyirong.github.io/tags/学习笔记/"}]},{"title":"岁月轻狂","date":"2017-07-16T07:49:25.000Z","path":"2017/07/16/岁月轻狂/","text":"&emsp;&emsp;昨天整理了豆列，全是自己想买的东西。今天因为凯尔经的秘密打开豆瓣电影，发现大学四年真的看了好多动画电影，那时候雪姐和大静还有伢伢只要有好的片子就不会放过，最神奇的是雪姐总能找到好多久远的但是好看的片子，尤其是认识李晓龙之后。&emsp;&emsp;我还能清晰的记起从青科吃完饭走回去时风的温度、天空的颜色、青科电台放的那首《岁月轻狂》。看向我们宿舍那一块，建筑高高低低，礼堂的屋顶尖尖的，宿舍晾晒的衣服迎风飘扬着。青科操场那一片天空格外的开阔，颜色总是那么多彩，望出去能看到西院操场上的人和远处海边的高楼。在那条路上有一株合欢树，我和伢伢专门去看过它的花。快到东院后门那里有一整墙如瀑的爬山虎，四年来一年比一年生机勃勃。而那面高高的围墙，好像从来没看到过头。从夏天开始一直到初秋，后门有一块地会有花门一样的玫瑰，间或几只钻出铁网对路人say hello。进了后门通往二综路两侧是山樱花和榆叶李，开花的时候满树满树的欣喜，不开花的时候总是映衬得天空特别蓝。树与树之间的空隙里可以看到东院操场，青岛真的是气候宜人，而那里又是风景绝佳，离开时最舍不得的就是那里，四年来在哪里发生过太多故事，欢乐悲伤平静愤怒，见证了我的一切，又陪伴了我的四年，我总想回去看看，什么都不做，就想再走几圈看看远山看看日落。&emsp;&emsp;回忆着竟然想起，大一的冬天，想给强哥织条围巾，寒夜里站在大门口跟卖毛线的大姐学，零下好几度的天气手都冻僵了。可是到最后也没有织好看，后来暑假在家想重新织条，却怎么都想不起怎么起头了。 2016-08-15 18:57:36","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"时间并不会把每个人带到同一个位置","date":"2017-07-16T04:47:31.000Z","path":"2017/07/16/时间并不会把每个人带到同一个位置/","text":"&emsp;&emsp;我姐上小学的时候，数学总是不及格，我比她小两级，每次我都笑话她，她就会说：我们数学难，等你上高年级你也考不及格。可是后来我上三年级四年级五年级六年级，成绩一直很好。时间并不会把每个人带到同样一个位置，决定位置高低的还是你自己啊。&emsp;&emsp;很多人喜欢在劝我的时候拿更差的人来做对比，这让我很不理解。一是我并不想和别人比，明明标准在那里，而我没达到而已。二是我只是陈述事实，不是消极难过，本就是不需要劝。&emsp;&emsp;每次这种时候我就会变成两个人，一个人耐心给她们解释I’m fine ，另一人在想我要这么多“朋友”干什么。事事嘘寒问暖有一个我妈，就够了。劝人的时候不要说一些违心的话，夸人的时候同样。既然是你的立场你就要时刻坚持，如果觉得说出来会伤害到别人，可以选择不说。我更喜欢耿直的朋友，他们让我觉得舒服。只是想法不同并不是要与你为敌，我们每个人都是有着独立思想的个体，我们成为朋友不过只是互相接纳互相包容的结果。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"那些话儿","date":"2017-07-15T13:21:16.000Z","path":"2017/07/15/那些话儿/","text":"&emsp;&emsp;我记性不好，又总是希望能记住生活中发生的听到的看到的所有事情，为此这些年一直坚持使用QQ空间留言板，用到都有人开始嘲笑我才慢慢转移阵地。后来收了workflow和印象笔记后，我开始每天和采蘑菇的小女孩似的，把喜欢的句子说过的话想珍藏的一切复制了往印象笔记里粘，还会时不时打开印象笔记一本满足的清点满筐的“蘑菇”。&emsp;&emsp;话特别多想法特别多的我在别人眼里越来越奇怪了，而我不能理解的人和事情也越来越多，篮子里采了那么多蘑菇却只能自己偶尔的拿出来看看，晒不到太阳不可避免的开始发霉了。人总是期待被理解，被认可，孤独也不过是宁为玉碎不为瓦全。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"我的博客简介","date":"2017-07-15T10:28:20.000Z","path":"2017/07/15/我的博客简介/","text":"&emsp;&emsp;之前一直想建一个自己的网站，本来打算的是买一个阿里云或者腾讯云的服务器，自己用node+vue+MongoDB前后端分离一整套做出来，但以我现在的能力又任重道远。前几日发现了GitPages，就打算利用Pages做点页面展示。&emsp;&emsp;昨天听Litten的直播课，听的时候一直感叹他的优秀，专门记住了名字。今天按原计划建我的博客，对比了一些流行的静态博客框架后决定采用hexo，主要是看到hexo是node.js写的，感觉有亲切感。&emsp;&emsp;找了个教程看着做，在选主题的时候看到Litten的名字，简直闪闪发光！啊，人生何处不相逢。&emsp;&emsp;过程中还是遇到很多问题，午饭后对着Litten的github和hexo的官方文档才搞清楚。晚饭后本来要做编程题，可是看Litten的博客有个相册功能，我又很想试试。","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://wongyirong.github.io/tags/学习笔记/"}]},{"title":"陌生人啊感谢你的好意","date":"2017-07-15T08:36:20.000Z","path":"2017/07/15/陌生人啊感谢你的好意/","text":"&emsp;&emsp;昨天在网上看IMWeb的笔试直播课，我才发现愚蠢而固步自封的我离前端工程师的路太远了。而留给我赶路的时间却不多，我知道自己必须停下来，记下这些感动，记住这些的来之不易的相逢。我一直后悔很多过去的事情，而过去的时光不再，当下也是未来会后悔的时刻啊。&emsp;&emsp;人生有很多弯路，明明别人一早就告诉你了，可你没走过你总不肯相信那真的是条弯路。也许不是现在我可能不会报这个班，如果不是现在我可能并不能恰好的体会这些，让我后悔的过去、走过的弯路其实都是最好的安排。&emsp;&emsp;昨天更大的收获是认识了一个真正优秀的前端工程师，我确信我爱自己的选择，但我真的离我想成为的人有很远的距离。陌生人啊，感谢你的好意你的真心，能在这一刻幡然醒悟，睁开双眼看世界，我应该感激。我的人生真是幸运，那些驼背走在路上唉声叹气的人，那些碌碌无为浑浑度日的人，他们都不曾遇到我这样的好运气。真感激，我是我，我遇到过这么多好人。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"裙角飞扬的日子","date":"2016-08-10T03:24:23.000Z","path":"2016/08/10/裙角飞扬的日子/","text":"最近有些压抑，人生的路要走向何方，我到底怎么了，我以后要怎么办，很多问题想不清，想梳理明白，各大社交网站越玩越寂寞，想静静的在自己的世界想清楚。2016-08-10 11:24:23 我的wordpress纪念 你的善良必须有点锋芒–不然就等于零。2016-08-11 09:19:11 20160825有咽炎，扁桃体炎，昨天和前几天有微微的嗓子痛，没在意，昨天晚上洗冷水，洗完就鼻塞难受，早上起来咽痛，轻微，清涕。20160826白天喝了很多红糖可乐姜茶，晚上咽干严重，鼻塞更甚。今天早上买了云南白药《风寒感冒颗粒》，效果比较明显，咽干好一些，鼻塞，流涕好一些，头痛也好了些，但是还是打喷嚏。明天再看效果。2016-08-25 08:59:51 记录 放在回忆里，不如忘记。醒来收到微信速来宝的消息，领了发现是之前东野兴冲冲给我预定的大冰的新作，我不知该说啥，自从当年亲眼见过他，我竟然感觉自己看穿了他，对他越来越不屑。东野要送我我也不知道如何拒绝，拿到翻开的兴趣都没有，希望东野能见谅，当然是建立在她不知道的前提下。我换了新号码竟然还能收到，要是没收到就好了。2016-08-16 14:44:02 翻出14年7月到9月的一些记录，发现也许你做的对。我走过很多弯路，我做过很多错事，如果只是记忆模糊就当它不存在这是多么自欺欺人，问题是我明明走过不止一个弯路，仍不知悔改。2016-08-10 16:34:05 明白那么多道理，仍然不想好好地过这一生。 明明快好了，昨晚一直不困，就一直熬到两点多才睡，早上实在是醒不来，头也痛，鼻塞更甚，咳嗽了一上午。中午睡醒竟有种熟悉的发烧的感觉，说不来的难受，在床上又呆了一个小时才好一些。 啊，我开通了CSDN博客，哈哈哈2016-08-28 19:09:59 病来如山倒","tags":[{"name":"碎碎念","slug":"碎碎念","permalink":"https://wongyirong.github.io/tags/碎碎念/"}]}]