[{"title":"从输入URL到页面加载完成到底发生了什么？","date":"2017-07-19T01:22:09.000Z","path":"2017/07/19/从输入URL到页面展示到底发生了什么/","text":"&emsp;&emsp;这应该是我开始学习前端之后看到的次数最多的一道面试题目，也是我最怕的一道题目了。计算机网络和硬件方面我还是个文盲，我对软件一直更感兴趣一点，对网络和硬件就比较心虚，寒暑假回家大爷大妈让我修电脑的时候，我只能无奈地一再强调自己是学软件的。为了更好地 为人民服务 学习前端，我准备从头到尾理清这道题，借此完成计算网络的攻坚克难战，顺便准备技术交流的素材。&emsp;&emsp;在我最开始的意识里，这个过程应该是在浏览器地址栏输入URL之后信息被送到了某处，然后获得回复，内容按照一定格式(前端要做的工作)展示在Web页面上。而事实上在电脑显示器后面在这短短的时间(网速好的话)内有太多看不到的过程发生了。 1.输入URL后浏览器做了什么我们先来理解一下URL是什么，它为我们做了什么(1)URL Uniform Resource Locator 统一资源定位符URI（Uniform Resource Identifier) 统一资源标识符URI用字符串标识某一互联网资源，而URL表示资源的地点（互联网上所处的位置），URL是URI的子集。基本URL包含协议方案名、服务器名称（或IP地址）、文件路径，比如 https://wongyirong.github.io/2017/07/19/从输入URL到页面展示到底发生了什么/ (2)负责域名解析的DNS服务 Domain Name System 应用层DNS协议提供通过域名查找IP地址，或逆向从IP地址反查域名的服务。 URL和DNS协议为我们标识了资源的地点，让我们知道去哪里请求需要的资源。 2.在传输过程中发生了什么Web采用HTTP协议作为规范，完成从客户端到服务器端的通信。HTTP协议 Hyper Text Transfer Protocol 超文本传输协议 应用层HTTP协议基于TCP/IP协议族进行网络通信。其中包括：（1）负责传输的IP协议 Internet Protocol 网际协议 网络层MAC地址 Media Acess Control Address使用ARP协议进行通信（2）确保可靠性的TCP协议 Transmission Control Protocol 传输控制协议 传输层为什么说它是确保可靠性的呢，TCP协议为了准确无误的将数据送达目标处采用了三次握手three-way-handshaking策略TCP 协议的三次握手 – 用以确认数据传输正确，会重试到完整地完成为止。 TCP/IP传输流：作为发送端的客户端在应用层（HTTP协议）发出HTTP请求。为了传输方便在传输层（TCP协议）把从应用层处收到的数据（HTTP请求报文）进行分割，并在格格报文上打上标记序号及端口号后转发给网络层。在网络层（IP协议）增加作为通讯目的地的MAC地址后转发给数据链路层。接收端的服务器在数据链路层接收到数据，发送到网络层传输层一直到应用层。这时候接收端的服务器才真正收到了了客户端的HTTP请求。 HTTP请求由三部分组成，分别是：请求行、首部字段、报文主体请求行以一个方法符号开头，以空格分开，后面跟着请求的URI和协议的版本，格式如下：Method Request-URI HTTP-Version CRLF其中 Method表示请求方法；Request-URI是一个统一资源标识符；HTTP-Version表示请求的HTTP协议版本；CRLF表示回车和换行（除了作为结尾的CRLF外，不允许出现单独的CR或LF字符）。请求方法有多种：GET 请求获取Request-URI所标识的资源POST 在Request-URI所标识的资源后附加新的数据HEAD 请求获取由Request-URI所标识的资源的响应消息报头PUT 请求服务器存储一个资源，并用Request-URI作为其标识DELETE 请求服务器删除Request-URI所标识的资源TRACE 请求服务器回送收到的请求信息，主要用于测试或诊断CONNECT 保留将来使用OPTIONS 请求查询服务器的性能，或者查询与资源相关的选项和需求 在html页面中输入URL、访问超链接、form提交（当然也可以设置method为POST）等都是GET请求方法，比如本题“从输入URL到页面加载完成到底发生了什么？”BTW：GET：一般用于信息获取，使用URL传递参数，对所发送信息的数量也有限制，一般在2000个字符POST：一般用于修改服务器上的资源，对所发送的信息没有限制。GET方式需要使用Request.QueryString来取得变量的值，而POST方式通过Request.Form来获取变量的值，也就是说Get是通过地址栏来传值，而Post是通过提交表单来传值。然而，在以下情况中，请使用 POST 请求：无法使用缓存文件（更新服务器上的文件或数据库）；向服务器发送大量数据（POST 没有数据量限制）；发送包含未知字符的用户输入时，POST比GET更稳定也更可靠。 HTTP响应也是由三个部分组成，分别是：状态行、首部字段、报文主体状态行格式：HTTP-Version Status-Code Reason-Phrase CRLF其中，HTTP-Version表示服务器HTTP协议的版本；Status-Code表示服务器发回的响应状态代码；Reason-Phrase表示状态代码的文本描述。比如HTTP/1.1 200 OK 响应状态代码有三位数字组成，第一个数字定义了响应的类别，且有五种可能取值：1xx：指示信息–表示请求已接收，继续处理2xx：成功–表示请求已被成功接收、理解、接受3xx：重定向–要完成请求必须进行更进一步的操作4xx：客户端错误–请求有语法错误或请求无法实现5xx：服务器端错误–服务器未能实现合法的请求常见状态代码、状态描述、说明：200 OK //客户端请求成功400 Bad Request //客户端请求有语法错误，不能被服务器所理解401 Unauthorized //请求未经授权，这个状态代码必须和WWW-Authenticate报头域一起使用403 Forbidden //服务器收到请求，但是拒绝提供服务404 Not Found //请求资源不存在，eg：输入了错误的URL500 Internal Server Error //服务器发生不可预期的错误503 Server Unavailable //服务器当前不能处理客户端的请求，一段时间后可能恢复正常 从100到199范围的HTTP状态码是信息报告码。基于各种原因考虑，大多数情况下我们 是很少看见这些代码的。首先，如果一个浏览器尝试访问一个网站，而网站返回这些代码时，它们往往都不会显示在屏幕上。它们只是浏览器使引用的内部码。另 外，这些代码不常见的另外一个原因是起初HTTP标准不允许使用这一范围的状态码。就其本身而言，它们也一直没有被广泛地使用。 HTTP/1.1首部字段一览 47种首部字段 在这里同学问我Expires是缓存还是Cookie的失效时间。Expires是将资源失效的日期告知客户端。源服务器不希望缓存服务器对资源缓存时会将Expires字段写入与首部字段Date相同的时间值，就像当时看到的百度的示例。但当同时存在Cache-control的max-age会优先处理max-age指令，忽略掉Expires。max-age代表资源保存为缓存的最长时间。 响应的结果也同样利用TCP/IP通信协议向客户端回传。 这里我的同学帮我补充了一点：关于cookie的状态管理HTTP是无状态协议，他不对之前发生过的请求和响应的状态进行管理。也就是说，无法根据之前的状态进行本次的请求处理。cookie技术通过在请求和响应报文中写入Cookie信息来控制客户端的状态。Cookie会根据从服务器端发送的响应的报文内的一个叫做Set-Cookie的首部字段信息，通知客户端保存Cookie。当下次客户端再往该服务器发送请求时，客户端会自动在请求报文中加入Cookie值后发送出去。服务器端发现客户端发送过来的Cookie后，会去检查究竟是从哪一个客户端发来的连接请求，然后对比服务器上的记录，最后的到之前的状态信息。还有一种服务端的机制——Session。Session是保存在服务端的，有一个唯一标识。在服务端保存Session的方法很多，内存、数据库、文件都有。集群的时候也要考虑Session的转移，在大型的网站，一般会有专门的Session服务器集群，用来保存用户会话，这个时候 Session 信息都是放在内存的，使用一些缓存服务比如Redis之类的来放 Session。区别：Session是在服务端保存的一个数据结构，用来跟踪用户的状态，这个数据可以保存在集群、数据库、文件中；Cookie是客户端保存用户信息的一种机制，用来记录用户的一些信息，也是实现Session的一种方式 3.请求到数据后浏览器做了什么当服务器提供了资源之后（HTML，CSS，JS，图片等），浏览器会执行下面的操作：解析 —— HTML，CSS，JS渲染 —— 构建 DOM 树 -&gt; 渲染 -&gt; 布局 -&gt; 绘制（1）首先，浏览器渲染引擎从网络层取得请求的资源，一般以8kB大小分块传输。（2）HTML解析器对HTML文档进行解析，生成解析树。解析树是以DOM（文档对象模型 Document Object Model）元素以及属性为节点的树。它是HTML文档的对象表示，同时也是HTML元素面向外部(如Javascript)的接口。树的根部是”Document”对象。整个DOM和HTML文档几乎是一对一的关系。（3）遇到css标签解析CSS生成CSS规则树（4）浏览器通过遍历CSS规则树和DOM节点树创建一个渲染树（Render Tree）（5）页面布局和绘制 注意：渲染结束后，JavaScript下载后JS操作修改DOM、修改样式都会造成渲染树的重新布局和重绘。只要修改DOM或修改了元素的形状或大小，就会触发Reflow，单纯修改元素的颜色只需Repaint一下。 参考资料：《图解http》腾讯IMWeb知乎专栏what-happens-when","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://wongyirong.github.io/tags/学习笔记/"}]},{"title":"爱你就像爱生命","date":"2017-07-16T11:48:49.000Z","path":"2017/07/16/爱你就像爱生命/","text":"你能建立良好的项目和解决问题，这才是最重要的，而你如何解决它们（所使用的工具）已经并将永远改变。If you can build good projects and solve problems then that’s all that matters, how you solve them (the tools) has and will always change.","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://wongyirong.github.io/tags/学习笔记/"}]},{"title":"岁月轻狂","date":"2017-07-16T07:49:25.000Z","path":"2017/07/16/岁月轻狂/","text":"&emsp;&emsp;昨天整理了豆列，全是自己想买的东西。今天因为凯尔经的秘密打开豆瓣电影，发现大学四年真的看了好多动画电影，那时候雪姐和大静还有伢伢只要有好的片子就不会放过，最神奇的是雪姐总能找到好多久远的但是好看的片子，尤其是认识李晓龙之后。&emsp;&emsp;我还能清晰的记起从青科吃完饭走回去时风的温度、天空的颜色、青科电台放的那首《岁月轻狂》。看向我们宿舍那一块，建筑高高低低，礼堂的屋顶尖尖的，宿舍晾晒的衣服迎风飘扬着。青科操场那一片天空格外的开阔，颜色总是那么多彩，望出去能看到西院操场上的人和远处海边的高楼。在那条路上有一株合欢树，我和伢伢专门去看过它的花。快到东院后门那里有一整墙如瀑的爬山虎，四年来一年比一年生机勃勃。而那面高高的围墙，好像从来没看到过头。从夏天开始一直到初秋，后门有一块地会有花门一样的玫瑰，间或几只钻出铁网对路人say hello。进了后门通往二综路两侧是山樱花和榆叶李，开花的时候满树满树的欣喜，不开花的时候总是映衬得天空特别蓝。树与树之间的空隙里可以看到东院操场，青岛真的是气候宜人，而那里又是风景绝佳，离开时最舍不得的就是那里，四年来在哪里发生过太多故事，欢乐悲伤平静愤怒，见证了我的一切，又陪伴了我的四年，我总想回去看看，什么都不做，就想再走几圈看看远山看看日落。&emsp;&emsp;回忆着竟然想起，大一的冬天，想给强哥织条围巾，寒夜里站在大门口跟卖毛线的大姐学，零下好几度的天气手都冻僵了。可是到最后也没有织好看，后来暑假在家想重新织条，却怎么都想不起怎么起头了。 2016-08-15 18:57:36","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"时间并不会把每个人带到同一个位置","date":"2017-07-16T04:47:31.000Z","path":"2017/07/16/时间并不会把每个人带到同一个位置/","text":"&emsp;&emsp;我姐上小学的时候，数学总是不及格，我比她小两级，每次我都笑话她，她就会说：我们数学难，等你上高年级你也考不及格。可是后来我上三年级四年级五年级六年级，成绩一直很好。时间并不会把每个人带到同样一个位置，决定位置高低的还是你自己啊。&emsp;&emsp;很多人喜欢在劝我的时候拿更差的人来做对比，这让我很不理解。一是我并不想和别人比，明明标准在那里，而我没达到而已。二是我只是陈述事实，不是消极难过，本就是不需要劝。&emsp;&emsp;每次这种时候我就会变成两个人，一个人耐心给她们解释I’m fine ，另一人在想我要这么多“朋友”干什么。事事嘘寒问暖有一个我妈，就够了。劝人的时候不要说一些违心的话，夸人的时候同样。既然是你的立场你就要时刻坚持，如果觉得说出来会伤害到别人，可以选择不说。我更喜欢耿直的朋友，他们让我觉得舒服。只是想法不同并不是要与你为敌，我们每个人都是有着独立思想的个体，我们成为朋友不过只是互相接纳互相包容的结果。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"那些话儿","date":"2017-07-15T13:21:16.000Z","path":"2017/07/15/那些话儿/","text":"&emsp;&emsp;我记性不好，又总是希望能记住生活中发生的听到的看到的所有事情，为此这些年一直坚持使用QQ空间留言板，用到都有人开始嘲笑我才慢慢转移阵地。后来收了workflow和印象笔记后，我开始每天和采蘑菇的小女孩似的，把喜欢的句子说过的话想珍藏的一切复制了往印象笔记里粘，还会时不时打开印象笔记一本满足的清点满筐的“蘑菇”。&emsp;&emsp;话特别多想法特别多的我在别人眼里越来越奇怪了，而我不能理解的人和事情也越来越多，篮子里采了那么多蘑菇却只能自己偶尔的拿出来看看，晒不到太阳不可避免的开始发霉了。人总是期待被理解，被认可，孤独也不过是宁为玉碎不为瓦全。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"我的博客简介","date":"2017-07-15T10:28:20.000Z","path":"2017/07/15/我的博客简介/","text":"&emsp;&emsp;之前一直想建一个自己的网站，本来打算的是买一个阿里云或者腾讯云的服务器，自己用node+vue+MongoDB前后端分离一整套做出来，但以我现在的能力又任重道远。前几日发现了GitPages，就打算利用Pages做点页面展示。&emsp;&emsp;昨天听Litten的直播课，听的时候一直感叹他的优秀，专门记住了名字。今天按原计划建我的博客，对比了一些流行的静态博客框架后决定采用hexo，主要是看到hexo是node.js写的，感觉有亲切感。&emsp;&emsp;找了个教程看着做，在选主题的时候看到Litten的名字，简直闪闪发光！啊，人生何处不相逢。&emsp;&emsp;过程中还是遇到很多问题，午饭后对着Litten的github和hexo的官方文档才搞清楚。晚饭后本来要做编程题，可是看Litten的博客有个相册功能，我又很想试试。","tags":[{"name":"学习笔记","slug":"学习笔记","permalink":"https://wongyirong.github.io/tags/学习笔记/"}]},{"title":"陌生人啊感谢你的好意","date":"2017-07-15T08:36:20.000Z","path":"2017/07/15/陌生人啊感谢你的好意/","text":"&emsp;&emsp;昨天在网上看IMWeb的笔试直播课，我才发现愚蠢而固步自封的我离前端工程师的路太远了。而留给我赶路的时间却不多，我知道自己必须停下来，记下这些感动，记住这些的来之不易的相逢。我一直后悔很多过去的事情，而过去的时光不再，当下也是未来会后悔的时刻啊。&emsp;&emsp;人生有很多弯路，明明别人一早就告诉你了，可你没走过你总不肯相信那真的是条弯路。也许不是现在我可能不会报这个班，如果不是现在我可能并不能恰好的体会这些，让我后悔的过去、走过的弯路其实都是最好的安排。&emsp;&emsp;昨天更大的收获是认识了一个真正优秀的前端工程师，我确信我爱自己的选择，但我真的离我想成为的人有很远的距离。陌生人啊，感谢你的好意你的真心，能在这一刻幡然醒悟，睁开双眼看世界，我应该感激。我的人生真是幸运，那些驼背走在路上唉声叹气的人，那些碌碌无为浑浑度日的人，他们都不曾遇到我这样的好运气。真感激，我是我，我遇到过这么多好人。","tags":[{"name":"随笔","slug":"随笔","permalink":"https://wongyirong.github.io/tags/随笔/"}]},{"title":"裙角飞扬的日子","date":"2016-08-10T03:24:23.000Z","path":"2016/08/10/裙角飞扬的日子/","text":"明明快好了，昨晚一直不困，就一直熬到两点多才睡，早上实在是醒不来，头也痛，鼻塞更甚，咳嗽了一上午。中午睡醒竟有种熟悉的发烧的感觉，说不来的难受，在床上又呆了一个小时才好一些。 啊，我开通了CSDN博客，哈哈哈2016-08-28 19:09:59 病来如山倒 20160825有咽炎，扁桃体炎，昨天和前几天有微微的嗓子痛，没在意，昨天晚上洗冷水，洗完就鼻塞难受，早上起来咽痛，轻微，清涕。20160826白天喝了很多红糖可乐姜茶，晚上咽干严重，鼻塞更甚。今天早上买了云南白药《风寒感冒颗粒》，效果比较明显，咽干好一些，鼻塞，流涕好一些，头痛也好了些，但是还是打喷嚏。明天再看效果。2016-08-25 08:59:51 记录 放在回忆里，不如忘记。醒来收到微信速来宝的消息，领了发现是之前东野兴冲冲给我预定的大冰的新作，我不知该说啥，自从当年亲眼见过他，我竟然感觉自己看穿了他，对他越来越不屑。东野要送我我也不知道如何拒绝，拿到翻开的兴趣都没有，希望东野能见谅，当然是建立在她不知道的前提下。我换了新号码竟然还能收到，要是没收到就好了。2016-08-16 14:44:02 你的善良必须有点锋芒–不然就等于零。2016-08-11 09:19:11 翻出14年7月到9月的一些记录，发现也许你做的对。我走过很多弯路，我做过很多错事，如果只是记忆模糊就当它不存在这是多么自欺欺人，问题是我明明走过不止一个弯路，仍不知悔改。2016-08-10 16:34:05 明白那么多道理，仍然不想好好地过这一生。 最近有些压抑，人生的路要走向何方，我到底怎么了，我以后要怎么办，很多问题想不清，想梳理明白，各大社交网站越玩越寂寞，想静静的在自己的世界想清楚。2016-08-10 11:24:23 我的wordpress纪念","tags":[{"name":"碎碎念","slug":"碎碎念","permalink":"https://wongyirong.github.io/tags/碎碎念/"}]}]